[{"name":"Hip Circles (Prone)","type":"stretching","muscle":"abductors","equipment":"None","difficulty":"intermediate","instructions":"Position yourself on your hands and knees on the ground. Maintaining good posture, raise one bent knee off of the ground. This will be your starting position. Keeping the knee in a bent position, rotate the femur in an arc, attempting to make a big circle with your knee. Perform this slowly for a number of repetitions, and repeat on the other side."},{"name":"Standing Hip Circles","type":"stretching","muscle":"abductors","equipment":"body_only","difficulty":"beginner","instructions":"Begin standing on one leg, holding to a vertical support. Raise the unsupported knee to 90 degrees. This will be your starting position. Open the hip as far as possible, attempting to make a big circle with your knee. Perform this movement slowly for a number of repetitions, and repeat on the other side."},{"name":"Clam","type":"strength","muscle":"abductors","equipment":"None","difficulty":"intermediate","instructions":"Begin by lying on your side on the ground. Support your head on your left arm. Flex the hips to 45 degrees and the knees to approximately 90 degrees, with your right leg directly on top of your left. This will be your starting position. Initiate the exercise by abducting your right leg, pushing your knee away from the midline of your body. Maintain contact between your feet throughout the movement. Pause at the top of the motion, and then return to the starting position. Repeat for the desired number of repetitions. Do both sides."},{"name":"Iliotibial band SMR","type":"stretching","muscle":"abductors","equipment":"foam_roll","difficulty":"intermediate","instructions":"Lay on your side, with the bottom leg placed onto a foam roller between the hip and the knee. The other leg can be crossed in front of you. Place as much of your weight as is tolerable onto your bottom leg; there is no need to keep your bottom leg in contact with the ground. Be sure to relax the muscles of the leg you are stretching. Roll your leg over the foam from you hip to your knee, pausing for 10-30 seconds at points of tension. Repeat with the opposite leg."},{"name":"Thigh abductor","type":"strength","muscle":"abductors","equipment":"machine","difficulty":"intermediate","instructions":"To begin, sit down on the abductor machine and select a weight you are comfortable with. When your legs are positioned properly, grip the handles on each side. Your entire upper body (from the waist up) should be stationary. This is the starting position. Slowly press against the machine with your legs to move them away from each other while exhaling. Feel the contraction for a second and begin to move your legs back to the starting position while breathing in. Note: Remember to keep your upper body stationary to prevent any injuries from occurring. Repeat for the recommended amount of repetitions."},{"name":"Fire Hydrant","type":"strength","muscle":"abductors","equipment":"body_only","difficulty":"beginner","instructions":"Position yourself on your hands and knees on the ground. This will be your starting position. Keeping the knee in a bent position, abduct the femur, moving your knee away from the midline of the body. Pause at the top of the motion, and then slowly return to the starting position. Perform this slowly for a number of repetitions, and repeat on the other side."},{"name":"Windmills","type":"stretching","muscle":"abductors","equipment":"body_only","difficulty":"intermediate","instructions":"Lie on your back with your arms extended out to the sides and your legs straight. This will be your starting position. Lift one leg and quickly cross it over your body, attempting to touch the ground near the opposite hand. Return to the starting position, and repeat with the opposite leg. Continue to alternate for 10-20 repetitions."},{"name":"Monster Walk","type":"strength","muscle":"abductors","equipment":"body_only","difficulty":"intermediate","instructions":"Place a band around both ankles and another around both knees. There should be enough tension that they are tight when your feet are shoulder width apart. To begin, take short steps forward alternating your left and right foot. After several steps, do just the opposite and walk backward to where you started."},{"name":"IT Band and Glute Stretch","type":"stretching","muscle":"abductors","equipment":"body_only","difficulty":"intermediate","instructions":"Loop a belt, rope, or band around one of your feet, and swing that leg across your body to the opposite side, keeping the leg extended as you lay on the ground. This will be your starting position. Keeping your foot off of the floor, pull on the belt, using the tension to pull the toes up. Hold for 10-20 seconds, and repeat on the other side."},{"name":"Single-leg lying cross-over stretch","type":"stretching","muscle":"abductors","equipment":"body_only","difficulty":"beginner","instructions":"Lie on your back with your legs extended. Cross one leg over your body with the knee bent, attempting to touch the knee to the ground. Your partner should kneel beside you, holding your shoulder down with one hand and controlling the crossed leg with the other. this will be your starting position. Attempt to raise the bent knee off of the ground as your partner prevents any actual movement. After 10-20 seconds, relax the leg as your partner gently presses the knee towards the floor. Repeat with the other side."}]