[{"name":"Thigh adductor","type":"strength","muscle":"adductors","equipment":"machine","difficulty":"intermediate","instructions":"To begin, sit down on the adductor machine and select a weight you are comfortable with. When your legs are positioned properly on the leg pads of the machine, grip the handles on each side. Your entire upper body (from the waist up) should be stationary. This is the starting position. Slowly press against the machine with your legs to move them towards each other while exhaling. Feel the contraction for a second and begin to move your legs back to the starting position while breathing in. Note: Remember to keep your upper body stationary and avoid fast jerking motions in order to prevent any injuries from occurring. Repeat for the recommended amount of repetitions."},{"name":"Groiners","type":"stretching","muscle":"adductors","equipment":"body_only","difficulty":"beginner","instructions":"Begin in a pushup position on the floor. This will be your starting position. Using both legs, jump forward landing with your feet next to your hands. Keep your head up as you do so. Return to the starting position and immediately repeat the movement, continuing for 10-20 repetitions."},{"name":"Band Hip Adductions","type":"strength","muscle":"adductors","equipment":"bands","difficulty":"beginner","instructions":"Anchor a band around a solid post or other object. Stand with your left side to the post, and put your right foot through the band, getting it around the ankle. Stand up straight and hold onto the post if needed. This will be your starting position. Keeping the knee straight, raise your right legs out to the side as far as you can. Return to the starting position and repeat for the desired rep count. Switch sides."},{"name":"Side Leg Raises","type":"stretching","muscle":"adductors","equipment":"body_only","difficulty":"beginner","instructions":"Stand next to a chair, which you may hold onto as a support. Stand on one leg. This will be your starting position. Keeping your leg straight, raise it as far out to the side as possible, and swing it back down, allowing it to cross the opposite leg. Repeat this swinging motion 5-10 times, increasing the range of motion as you do so."},{"name":"Lateral hop","type":"plyometrics","muscle":"adductors","equipment":"body_only","difficulty":"intermediate","instructions":"Assume a half squat position facing 90 degrees from your direction of travel. This will be your starting position. Allow your lead leg to do a countermovement inward as you shift your weight to the outside leg. Immediately push off and extend, attempting to bound to the side as far as possible. Upon landing, immediately push off in the opposite direction, returning to your original start position. Continue back and forth for several repetitions."},{"name":"Groin and Back Stretch","type":"stretching","muscle":"adductors","equipment":"none","difficulty":"beginner","instructions":"Sit on the floor with your knees bent and feet together. Interlock your fingers behind your head. This will be your starting position. Curl downwards, bringing your elbows to the inside of your thighs. After a brief pause, return to the starting position with your head up and your back straight. Repeat for 10-20 repetitions."},{"name":"Adductor SMR","type":"stretching","muscle":"adductors","equipment":"foam_roll","difficulty":"beginner","instructions":"Lie face down with one leg on a foam roll. Rotate the leg so that the foam roll contacts against your inner thigh. Shift as much weight onto the foam roll as can be tolerated. While trying to relax the muscles if the inner thigh, roll over the foam between your hip and knee, holding points of tension for 10-30 seconds. Repeat with the other leg."},{"name":"Side Lying Groin Stretch","type":"stretching","muscle":"adductors","equipment":"body_only","difficulty":"intermediate","instructions":"Start off by lying on your right side and bend your right knee in front of you to stabilize the torso. Rest your head on your right hand or shoulder. Lift your left leg upward and hold it by the back of the knee (easier) or the foot (harder). Pull your left knee in toward your left shoulder and simultaneously press your foot or knee down to the floor. To intensify this stretch, straighten your left leg. Switch sides."},{"name":"Adductor/Groin","type":"stretching","muscle":"adductors","equipment":"none","difficulty":"beginner","instructions":"Lie on your back with your feet raised towards the ceiling. Have your partner hold your feet or ankles. Abduct your legs as far as you can. This will be your starting position. Attempt to squeeze your legs together for 10 or more seconds, while your partner prevents you from doing so. Now, relax the muscles in your legs as your partner pushes your feet apart, stretching as far as is comfortable for you. Be sure to let your partner know when the stretch is adequate to prevent overstretching or injury."},{"name":"Lying Bent Leg Groin","type":"stretching","muscle":"adductors","equipment":"other","difficulty":"beginner","instructions":"Lie on your back with your knees bent and the soles of the feet pressed together. Have your partner hold your knees. This will be your starting position. Attempt to squeeze your knees together, while your partner prevents any movement from occurring. After 10-20 seconds, relax your muscles as your partner gently pushes your knees towards the floor. Be sure to inform your helper when the stretch is adequate to prevent injury or overstretching."}]