[{"name":"Lying Face Down Plate Neck Resistance","type":"strength","muscle":"neck","equipment":"other","difficulty":"beginner","instructions":"Lie face down with your whole body straight on a flat bench while holding a weight plate behind your head. Tip: You will need to position yourself so that your shoulders are slightly above the end of a flat bench in order for the upper chest, neck and face to be off the bench. This will be your starting position. While keeping the plate secure on the back of your head slowly lower your head (as in saying yes) as you breathe in. Raise your head back up to the starting position in a semi-circular motion as you breathe out. Hold the contraction for a second. Repeat for the recommended amount of repetitions.  Caution: As with all exercises, refrain from using any sort of sudden or jerking motions. Variation: You can opt to use no resistance at first."},{"name":"Lying Face Up Plate Neck Resistance","type":"strength","muscle":"neck","equipment":"other","difficulty":"beginner","instructions":"Lie face up with your whole body straight on a flat bench while holding a weight plate on top of your forehead. Tip: You will need to position yourself so that your shoulders are slightly above the end of a flat bench in order for the traps, neck and head to be off the bench. This will be your starting position. While keeping the plate secure on your forehead slowly lower your head back in a semi-circular motion as you breathe in. Raise your head back up to the starting position in a semi-circular motion as you breathe out. Hold the contraction for a second. Repeat for the recommended amount of repetitions.  Caution: As with all exercises, refrain from using any sort of sudden or jerking motions. Variation: You can opt to use no resistance at first."},{"name":"Seated Head Harness Neck Resistance","type":"strength","muscle":"neck","equipment":"other","difficulty":"beginner","instructions":"Place a neck strap on the floor at the end of a flat bench. Once you have selected the weights, sit at the end of the flat bench with your feet wider than shoulder width apart from each other. Your toes should be pointed out. Slowly move your torso forward until it is almost parallel with the floor. Using both hands, securely position the neck strap around your head. Tip: Make sure the weights are still lying on the floor to prevent any strain on the neck. Now grab the weight with both hands while elevating your torso back until it is almost perpendicular to the floor. Note: Your head and torso needs to be slightly tilted forward to perform this exercise. Now place both hands on top of your knees. This is the starting position. Slowly lower your neck down until your chin touches the upper part of your chest while breathing in. While exhaling, bring your neck back to the starting position. Repeat for the recommended amount of repetitions.  Caution: This exercise puts a lot of stress on the neck muscles and should be approached with caution. Any sudden jerk or movement can cause you to strain a neck muscle. It is best to practice the form at first without any weights to get used to the movements required for this exercise."},{"name":"Isometric Neck Exercise - Sides","type":"strength","muscle":"neck","equipment":"body_only","difficulty":"beginner","instructions":"With your head and neck in a neutral position (normal position with head erect facing forward), place your left hand on the left side of your head. Now gently push towards the left as you contract the left neck muscles but resisting any movement of your head. Start with slow tension and increase slowly. Keep breathing normally as you execute this contraction. Hold for the recommended number of seconds. Now release the tension slowly. Rest for the recommended amount of time and repeat with your right hand placed on the right side of your head.  Variations: You can also do this exercise by placing your hands to the front and then to the back of your head. First do one side and then the next."},{"name":"Isometric Neck Exercise - Front And Back","type":"strength","muscle":"neck","equipment":"body_only","difficulty":"beginner","instructions":"With your head and neck in a neutral position (normal position with head erect facing forward), place both of your hands on the front side of your head. Now gently push forward as you contract the neck muscles but resisting any movement of your head. Start with slow tension and increase slowly. Keep breathing normally as you execute this contraction. Hold for the recommended number of seconds. Now release the tension slowly. Rest for the recommended amount of time and repeat with your hands placed on the back side of your head.  Variations: You can also do this exercise by placing your hands on the sides of your head. First do one side and then the next."},{"name":"Neck Bridge Prone","type":"strength","muscle":"neck","equipment":"body_only","difficulty":"beginner","instructions":"Begin in a prone position on the floor, on your hands and knees. Place your head next to your hands but a few inches nearer your legs, then extend your legs, driving your hips into the air. Transition into supporting your weight on your head by removing your hands from the ground. Perform this movement slowly, backing off if any serious discomfort is felt and avoiding it if you have any pre-existing neck injury. Hold the neck bridge for a period of time, and then carefully return your hands and knees to the floor."},{"name":"Side Neck Stretch","type":"stretching","muscle":"neck","equipment":"body_only","difficulty":"intermediate","instructions":"Start with your shoulders relaxed, gently tilt your head towards your shoulder. Assist stretch with a gentle pull on the side of the head."},{"name":"Chin To Chest Stretch","type":"stretching","muscle":"neck","equipment":"None","difficulty":"intermediate","instructions":"Get into a seated position on the floor. Place both hands at the rear of your head, fingers interlocked, thumbs pointing down and elbows pointing straight ahead. Slowly pull your head down to your chest. Hold for 20-30 seconds."},{"name":"Neck-SMR","type":"stretching","muscle":"neck","equipment":"body_only","difficulty":"intermediate","instructions":"Using a muscle roller or a rolling pin, place the roller behind your head and against your neck. Make sure that you do not place the roller directly against the spine, but turned slightly so that the roller is pressed against the muscles to either side of the spine. This will be your starting position. Starting at the top of your neck, slowly roll down the muscles of your neck, pausing at points of tension for 10-30 seconds."},{"name":"Neck-SMR","type":"stretching","muscle":"neck","equipment":"body_only","difficulty":"intermediate","instructions":"Using a muscle roller or a rolling pin, place the roller behind your head and against your neck. Make sure that you do not place the roller directly against the spine, but turned slightly so that the roller is pressed against the muscles to either side of the spine. This will be your starting position. Starting at the top of your neck, slowly roll down the muscles of your neck, pausing at points of tension for 10-30 seconds."}]